####P271 , 9.1
x1<-c(35,40,40,42,37,45,43,37,44,42)
x2<-c(60,74,64,71,72,68,78,66,70,65)
y<-c(1600,2600,2100,2650,2400,2200,2750,1600,2750,2500)
d<-data.frame(x1,x2,y)
plot(y,x1)
plot(y,x2)
cor.test(y,x1)
cor.test(y,x2)
cor(d)    

#####9.2
x<-seq(20,65,by=5)
y<-c(13.2,15.1,16.4,17.1,17.9,18.7,19.6,21.2,22.5,24.3)
m<-lm(y~x);m
summary(m)

point<-data.frame(x=42)
lm.pred<-predict(m,point,interval="prediction",level=0.95)
lm.pred

####9.5
x1<-c(120,190,155,125,180,140,130,175,145,150)
x2<-c(100,90,210,250,300,110,150,150,270,250)
y<-c(102,120,46,26,65,100,77,93,69,85)
m1<-lm(y~x1+x2);m1
summary(m1)

plot(m1)

point<-data.frame(x1=170,x2=160)
predict(m1,point,interval="prediction",level=0.95)


m2<-lm(y~x1+x2+I(x1^2)+I(x2^2)+I(x1*x2));m2
summary(m2)
m3=step(m2)
summary(m3)


#####9.6
Y<-c(33.2,40.3,38.7,46.8,41.4,37.5,39,40.7,30.1,52.9,38.2,31.8,43.3,44.1,42.8,33.6,34.2,48.0,38,35.9,40.4,36.8,45.2,35.1)
X1<-c(3.5,5.3,5.1,5.8,4.2,6.0,6.8,5.5,3.1,7.2,4.5,4.9,8.0,5.6,6.6,3.7,6.2,7.0,4.0,4.5,5.9,5.6,4.8,3.9)
X2<-c(9,20,18,33,31,13,25,30,5,47,25,11,23,35,39,31,7,40,35,23,33,27,34,15)
X3<-c(6.1,6.4,7.4,6.7,7.5,5.9,6.0,4.0,5.8,8.3,5.0,6.4,7.6,7.0,5,4.4,5.5,7,6,3.5,4,4.3,8,5)
dat<-data.frame(Y,X1,X2,X3)
dat

lm.reg<-lm(Y~X1+X2+X3,data=dat)
summary(lm.reg)

X0<-data.frame(X1=5.1,X2=20,X3=7.2)  ##此处数据框中的三个变量X1,X2,X3一定要与前面模型中变量名一致，换成X01或x01都会出错
predict(lm.reg,X0,interval="prediction",level=0.95)

##一下说明predict（）函数中的newdata的变量名一定是X1，X2，X3
X0<-dat[1:2,1:3]  ##此处数据框中的三个变量X1,X2,X3一定要与前面模型中变量名一致，换成X01或x01都会出错
colnames(X0)<-c("X1","X2","X3")
predict(lm.reg,X0,interval="prediction",level=0.95)

#检验下16.5485+1.3263*5.1+0.3075*20+1.3598*7.2



###9.9
x1<-c(70,60,70,40,40,70,70,80,60,30,80,40,60,40,20,50,50,40,80,70,60,90,50,70,20,80,60,50,70,40,30,30,40,60,80,70,30,60,80,70)
x2<-c(64,63,65,69,63,48,48,63,63,53,43,55,66,67,61,63,66,68,41,53,37,54,52,50,65,52,70,40,36,44,54,59,69,50,62,68,39,49,64,67)
x3<-c(5,9,11,10,58,9,11,4,14,4,12,2,25,23,19,4,16,12,12,8,13,12,8,7,21,28,13,13,22,36,9,87,5,22,4,15,4,11,10,18)
x4<-c(1,1,1,1,1,1,1,2,2,2,2,2,2,2,3,3,0,0,0,0,1,1,1,1,1,1,1,1,2,2,2,2,3,3,3,0,0,0,0,0)
x5<-rep(c(1,0),c(21,19))
y<-c(1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,1,1,0,1,1,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1)
dat<-data.frame(x1,x2,x3,x4,x5,y)
dat

model.1<-glm(y~x1+x2+x3+x4+x5,data=dat,family=binomial)
summary(model.1)

#预测P(Y=1)概率
  	#尝试下计算第40号病人生存时间Y=1的概率：
	aa<-(-7.01140)+0.09994*70+0.01415*67+0.01749*18-1.08297*0-0.61309*0
	exp(aa)/(1+exp(aa)) 

pred.1<-predict(model.1,dat[,-6])  #注意到newdata=原数据集中去掉y对应的列
p1<-exp(pred.1)/(1+exp(pred.1));p1

#再作模型诊断与更新：由于模型1中在显著性水平alpha取0.1时，变量x2，x3和x4不显著，可用step（）作模型优选
model.2<-step(model.1)
summary(model.2)

#预测P(Y=1)概率
  #尝试下计算第40号病人生存时间Y=1的概率：
   aa<--6.13755+0.09759*70-1.12524*0
   exp(aa)/(1+exp(aa))

pred.2<-predict(model.2,dat[,c(1,4)])
p2<-exp(pred.2)/(1+exp(pred.2));p2

cbind(p1,p2)   #模型1的概率偏高些


